app/Controllers/Hitung.php

SELECT *
FROM `alternatif`
SELECT *
FROM `kriteria`
---
    public function index()
    {
        $subkriteria = $this->subKriteria->get_subkriteria()->getResultArray();

        $countIdKriteria = [];
        foreach($subkriteria as $sub) {
            if(!array_key_exists($sub['id_kriteria'], $countIdKriteria)){
                $countIdKriteria[$sub['id_kriteria']] = 1;
            } else {
                $countIdKriteria[$sub['id_kriteria']] += 1;
            }
        }

        $data = [
            'title' => "FAHP - Hasil Perhitungan",
            'head' => "Hasil Perhitungan",
            'kriteria' => $this->kriteria->get()->getResultArray(),
            'subkriteria' => $subkriteria,
            'alternatif' => $this->alternatif->get()->getResultArray(),
            'totalSub' => $countIdKriteria,
        ];

SELECT *
FROM `alternatif`
---
    public function hasil_akhir(){
        $post = $this->request->getPost();

        $hasil_sub = json_decode($post['hasil_sub']);
        $hasil_krit = json_decode($post['hasil_krit']);

        $subkriteria = $this->subKriteria->get_subkriteria()->getResultArray();

        $countIdKriteria = [];
        foreach($subkriteria as $sub) {
            if(!array_key_exists($sub['id_kriteria'], $countIdKriteria)){
                $countIdKriteria[$sub['id_kriteria']] = 1;
            } else {
                $countIdKriteria[$sub['id_kriteria']] += 1;
            }
        }

        $alternatif = $this->alternatif->get()->getResultArray();